## Preprocessing

In [30]:
# Import the necessary libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [31]:
# Import the dataset
df = pd.read_csv('car_df.csv')

In [32]:
# Print the first 5 rows
df.head()

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
0,Toyota Harrier,Automatic,2000 CC,Foreign Used,2017,"KES 3,450,000"
1,Audi SQ5,Automatic,3000 CC,Foreign Used,2018,"KES 6,463,700"
2,Range Rover Vogue SV,Automatic,4400 CC,Foreign Used,2023,"KES 51,400,000"
3,Isuzu MUX,Automatic,3000 CC,Foreign Used,2022,"KES 8,600,000"
4,Mazda CX5,Automatic,2500 CC,Foreign Used,2019,"KES 4,788,209"

In [33]:
# Check the data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2445 entries, 0 to 2444
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                2445 non-null   object
 1   Transimission_Type  2445 non-null   object
 2   Engine_Size         2445 non-null   object
 3   Usage_Origin        2445 non-null   object
 4   Year                2445 non-null   int64
 5   Price               2445 non-null   object
dtypes: int64(1), object(5)
memory usage: 114.7+ KB

* Price column needs to be converted into float type.

### Duplicates

In [34]:
# Check for duplicates
df.duplicated().sum()

64

* The dataset had 64 duplicates which were all droped.

### Nulls

In [35]:
df.isnull().sum()

Name                  0
Transimission_Type    0
Engine_Size           0
Usage_Origin          0
Year                  0
Price                 0
dtype: int64

* The dataset does not have any null values.

### Data inconsistency

#### i. Transmission Type

In [36]:
df['Transimission_Type'].unique()

array(['Automatic', 'Manual', 'Foreign Used'], dtype=object)

* The rows with 'Foreign Used' values under Transimission_Type column needs to be dropped.

#### v. Engine size

In [37]:
df['Engine_Size'].unique()

array(['2000 CC', '3000 CC', '4400 CC', '2500 CC', '2800 CC', '1200 CC',
       '1600 CC', '3500 CC', '3600 CC', '2200 CC', '1300 CC', '2100 CC',
       '1500 CC', '5000 CC', '2400 CC', '1400 CC', '4500 CC', '3200 CC',
       '4000 CC', '2700 CC', '1800 CC', '5700 CC', '4600 CC', '2900 CC',
       '660 CC', '3300 CC', '6400 CC', '3800 CC', '3900 CC', '5500 CC',
       '1000 CC', '2993 CC', '2140 CC', '4200 CC', '6000 CC', '2300 CC',
       '4700 CC', ' ', '2143 CC', '2018 CC', '2017 CC', '2600 CC',
       '6200 CC', 'Foreign Used', 'Kenyan Used', '2148 CC', '750 CC',
       '900 CC', '2350 CC', '5200 CC', '5600 CC', '1242 CC', '650 CC',
       '4300 CC', '2956 CC', '1499 CC'], dtype=object)

* There some inconsistencies under the 'Engine_Size' column like having some 'Usage_Origin' values.
* The column should also be converted to a float type.

#### ii. Usage Origin

In [38]:
df['Usage_Origin'].unique()

array(['Foreign Used', 'Kenyan Used'], dtype=object)

* The column Usage Origin does not have any issue.

#### iii. Year

In [39]:
df['Year'].unique()

array([2017, 2018, 2023, 2022, 2019, 2021, 2008, 2015, 2014, 2013, 2016,
       2001, 2012, 2007, 2009, 2000, 2011, 2010, 2002, 2020, 2006, 2005,
       2003, 1999, 2024, 2004, 1997, 1996, 1998, 1990, 1979, 1981, 1989,
       1994, 1995], dtype=int64)

* The colum Year does not have any problem.

#### iv. Price

In [40]:
# Check if there are other currencies
other_currencies = df[~df['Price'].str.contains('KES')]
other_currencies

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
2412,Mercedes-Benz E350 D,Automatic,3000 CC,Foreign Used,2017,"£26,052"

* There is one row where the price is in euros, therefore it should be converted to KES after converting the column price into float.

## Initial Cleaning

#### i. Transmission Types

In [41]:
# Identify rows with 'Foreign Used' values
df[df['Transimission_Type'] == 'Foreign Used']

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
553,Toyota Landcruiser,Foreign Used,,Foreign Used,2017,"KES 10,450,000"

* Only one row with the inconsistency, hence drop the row.

In [42]:
df['Transimission_Type'] = df['Transimission_Type'].replace('Foreign Used', '')

In [43]:
# Confirm if the has been droped
df[df['Transimission_Type'] == 'Foreign Used']

Empty DataFrame
Columns: [Name, Transimission_Type, Engine_Size, Usage_Origin, Year, Price]
Index: []

* The row has been dropped successfully

#### ii. Engine_Size

In [44]:
# Drop all characters that are not numeric and convert the column to numeric type
df['Engine_Size'] = pd.to_numeric(df['Engine_Size'].str.replace(r'[^0-9.]', '', regex = True), errors = 'coerce')

In [45]:
# Confirm if droped
df['Engine_Size'].unique()

array([2000., 3000., 4400., 2500., 2800., 1200., 1600., 3500., 3600.,
       2200., 1300., 2100., 1500., 5000., 2400., 1400., 4500., 3200.,
       4000., 2700., 1800., 5700., 4600., 2900.,  660., 3300., 6400.,
       3800., 3900., 5500., 1000., 2993., 2140., 4200., 6000., 2300.,
       4700.,   nan, 2143., 2018., 2017., 2600., 6200., 2148.,  750.,
        900., 2350., 5200., 5600., 1242.,  650., 4300., 2956., 1499.])

* The inconsistent values from usage origin column have been converted to nan now the 'Engine_Size' column is numeric.

#### iii. Price

In [46]:
# Convert the Price column to float type
df['Price'] = df['Price'].str.replace(r'[^0-9.]', '', regex = True).astype(float)

* The column Price has been converted to float therefore now convert the price in euros into KES

In [47]:
# Convert the euro price into KES and confirm if converted
df.at[2412, 'Price'] *= 167.2

In [48]:
# confirm if converted using iloc
df.iloc[[2412]]

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
2412,Mercedes-Benz E350 D,Automatic,3000.0,Foreign Used,2017,4355894.4

* Now the price has been converted to KES

### Summary Statistics

In [50]:
df.describe()

       Engine_Size         Year         Price
count  2440.000000  2445.000000  2.445000e+03
mean   2246.922951  2015.247444  4.440872e+06
std     896.971309     3.970704  5.165748e+06
min     650.000000  1979.000000  2.199990e+05
25%    1600.000000  2014.000000  1.649999e+06
50%    2000.000000  2016.000000  2.899999e+06
75%    2700.000000  2017.000000  4.849999e+06
max    6400.000000  2024.000000  6.950000e+07

### Drop Duplicates

In [54]:
# Drop the duplicates
df.drop_duplicates(inplace = True)

In [56]:
# Confirm if droped
df.duplicated().sum()

0

* Now the Duplicates have been all droped.